[
    {
        "title": "PancakeSwap Sees 179% Growth in 2024 with $310B Volume",
        "content": "PancakeSwap, one of the top decentralized exchanges, has made a remarkable achievement in 2024 as its trading volume has increased.\nAs per the data from DefiLlama, the trading volume has reached $310.6 billion, which is 179% higher compared to the previous year. This growth shows a strong position in the multi-chain decentralized finance (DeFi) space.\nThis success is largely due to its expansion across nine blockchains, including BNB Chain, Base, Arbitrum, zkSync, Linea, Ethereum, Aptos, opBNB, and Polygon zkEVM. \nThese blockchain networks, especially Layer-2 solutions like Arbitrum, Base, and opBNB, offer faster and cheaper transactions, attracting more users to PancakeSwap.\nPancakeSwap has also seen a boost in its Total Value Locked (TVL), reaching $2.17 billion, and over 14.38 million unique traders have used the platform. These numbers show that the platform is growing in both scale and popularity.\nSeveral upgrades played a key role in PancakeSwap’s success this year. One significant upgrade is PancakeSwapX, which allows users to make fee-free, gasless swaps on Arbitrum and Ethereum.\nAnother important addition is the SpringBoard token launchpad, which helps launch tokens on the BNB Chain without any fees. Additionally, PancakeSwap launched AI-driven prediction markets on Arbitrum and introduced Telegram bots to streamline token swaps and predictions directly in Telegram.\nThe platform also upgraded its cross-chain capabilities with PancakeSwap Bridge, allowing transactions across eight different blockchains. Other improvements, like the Gauges Voting and veCAKE upgrades, have added to its flexibility and functionality.\nAs part of its strategy to ensure long-term stability, PancakeSwap burned 455.5 million $CAKE tokens, and it now has 1.79 million $CAKE holders worldwide. These efforts are aimed at maintaining the platform’s growth momentum as it moves into 2025, with plans for continued innovation and expansion across the multi-chain DeFi landscape.\nAlso Read: Crypto Trader Turns $712 into $3.95M Trading UFD Memecoin",
        "summary": "PancakeSwap, a leading decentralized exchange, has achieved a significant milestone in 2024 with its trading volume reaching $310.6 billion, a 179% increase from the previous year. The platform's success is attributed to its expansion across nine blockchains, offering faster and cheaper transactions through Layer-2 solutions. PancakeSwap has also seen growth in Total Value Locked and unique traders, with key upgrades like PancakeSwapX and SpringBoard token launchpad contributing to its success. The platform aims for continued innovation and expansion in the multi-chain DeFi space."
    },
    {
        "title": "Decentralized gaming project Treasure launches mainnet after DAO approved ZKsync migration",
        "content": "Reported by The Block: Decentralized gaming ecosystem Treasure has launched on mainnet after its DAO approved a migration to ZKsync.\nThe project initially planned to build using the Arbitrum Orbit toolkit.\nTreasure, the web3 gaming ecosystem that recently voted to migrate to ZKsync, has launched on mainnet, the project's DAO announced on Wednesday.\n\"This launch marks one of the largest ecosystem migrations in crypto.  Treasure is transferring over 15 games, significant assets including MAGIC, ERC-20 tokens, and hundreds of thousands of NFTs from its existing ecosystem on Arbitrum to its new home on ZKsync,\" according to a statement.  \"This migration coincides with several upcoming major token generation events and game launches planned for the network.\"\nMAGIC is Treasure's native token.  \"The MAGIC token serves as the backbone of the network, facilitating transactions, governance, and the overall economic landscape,\" according to Treasure.  It is used by DAO participants on governance votes.\nThe move marks the latest project to shift plans to build on a new blockchain, showcasing how various Ethereum Layer 2s are developing distinct ecosystems by offering different technical and cultural attributes that may benefit particular projects and communities.\nIn September, Treasure DAO members voted to approve a migration from Arbitrum Orbit to ZKsync. The proposal asserted that ZKsync was better “suited” to meet Treasure’s long-term plans in decentralized gaming. ZKsync is a Layer-2 scaling solution built by the company Matter Labs on Ethereum that uses \"zero-knowledge rollups\" to process transactions.\n\"To commemorate the launch, Treasure is introducing its 'Decentralized Entertainment System: Cartridges' campaign, offering free commemorative NFT mints based on its portfolio of games, inspired by classic gaming systems,\" the announcement also said. \"For a period following its launch, a new cartridge will become available daily to be minted and collected on Treasure.\"\nFounded in 2021, Treasure calls itself a decentralized game console. The ecosystem is home to several web3 gaming titles including \"The Beacon,\" \"Zeeverse,\" \"Wanderers,\" and \"Smolbound.\"",
        "summary": "Decentralized oyun ekosistemi Treasure, DAO'nun ZKsync'e göçüne onay vermesinin ardından mainnet üzerinde başlatıldı. Treasure'ın DAO'su, Çarşamba günü duyurdu. Projeye ait MAGIC adlı yerel tokenı kullanarak, Treasure, Arbitrum'daki mevcut ekosisteminden ZKsync'teki yeni evine 15'ten fazla oyun, MAGIC ve ERC-20 tokenları ve yüz binlerce NFT dahil önemli varlıkları aktarıyor."
    },
    {
        "title": "Web3 Talent Wanted: Top Jobs from Ripple, OpenSea & More – Dec 18th",
        "content": "Cryptopolitan brings you this week’s top picks from Web3 leaders like Ripple, OpenSea, and more. From engineering roles to marketing and operations, these jobs offer competitive pay, remote flexibility, and a chance to shape the future of blockchain.\nTech & Engineering\nCompany Name Position Years of Experience Salary Range Remote/Onsite Key Skills Apply \nMonad Developer Relations Engineer Not specified $150,000 – $200,000 Remote Solidity, TypeScript, DevRel for L1/L2, public speaking, technical writing https://jobs.ashbyhq.com/monad.foundation \nAlchemy Web3 Software Engineer  Not specified $135,000 – $350,000 Remote TypeScript, React (or equivalent), Node.js, web development tooling https://www.alchemy.com/careers \nZetaChain Web3 Site Reliability Engineer   2+ years  Not specified Remote Go, Ansible, Python, Grafana, Linux, Docker https://www.zetachain.com/careers \nOndo Finance Lead Blockchain Engineer Not specified $140,000 – $180,000 Remote Cosmos SDK, BFT consensus, EVM integration, smart contracts https://jobs.lever.co/ondofinance \nOperations\nCompany Name Position Years of Experience Salary Range Remote/Onsite Key Skills Apply\nParadigm Finance Manager 4-5 years $160,000 – $180,000 Remote Fund accounting, NAV processes, portfolio management, financial audits  https://www.paradigm.xyz/careers \nOKX Web3 Strategy Project Manager 3-5 years $72,000 – $112,000 Remote Strategic analysis, business analysis, management consulting, research skills, data analysis https://www.okx.com/join-us \nArbitrum Financial Operations Specialist Not specified Not specified Remote Accounts payable, financial reporting, risk management, cryptocurrency wallets https://arbitrum.foundation/careers \nRipple Sales Director 5-10 years $150,000 – $187,000 Hybrid Business development, financial institutions, digital asset custody  https://ripple.com/careers/all-jobs/ \nMarketing, Sales & Design \nCompany Name Position Years of Experience Salary Range Remote/Onsite Key Skills Apply\nOpenSea Product Design Lead Not specified $210,000 – $305,000 Remote Adobe CC, Product Design, Visual Design https://opensea.io/careers \nArbitrum Brand Marketer 5+ years Not specified Remote Blockchain & Crypto, Branding, Social Media, Content Marketing, Communication, Web3 https://arbitrum.foundation/careers\nIn a busy world overflowing with information, Cryptopolitan’s tailored newsletters curate the most important updates, daily crypto news, Web3 jobs, events, and airdrops—delivered straight to your inbox.\n\nStay informed without the noise. \nSign up here: https://www.cryptopolitan.com/newsletters/\nLand a High-Paying Web3 Job in 90 Days: The Ultimate Roadmap",
        "summary": "Bu haftanın en iyi seçkilerini Cryptopolitan'ın getirdiği Web3 liderlerinden Ripple, OpenSea ve daha fazlasını sizinle paylaşıyoruz. Mühendislik rollerinden pazarlama ve işletmeye kadar, bu işler rekabetçi maaşlar, uzaktan esneklik ve blokzincirin geleceğini şekillendirme fırsatı sunuyor. Ayrıntılı bilgi ve başvuru için linkleri ziyaret edebilirsiniz."
    },
    {
        "title": "Avalanche (AVAX) locks in $250M private sale round ahead of Avalanche9000 upgrade",
        "content": "Avalanche (AVAX) completed another step in transforming from a L2 into an independent L1 project. The platform raised $250M in a private sale, backed by some of the top VC funds. \nAvalanche (AVAX) extended its relationship with top VC funds, aiming to transform itself from a L2 chain and run an independent new L1. The most recent funding round for $250M was completed as a private placement with some of the leading investors in decentralized projects. \nThe funding was completed after an OTC sale, and was led by DragonFly Capital, Galaxy, and ParaFi Capital. The OTC placement reached up to 40 smaller companies and investors, some seeking to use the services of Avalanche as their native platform.\nAvalanche achieved its single biggest financing round for $250M. | Source: Cryptorank\nSince its launch, Avalanche raised more than $577M, including four ICO events, a seed round, and additional undisclosed funding. The recent fundraising effort is the single largest capital injection for Avalanche. \nAvalanche raised the funds as an addition to its track record of successful funding. The goal is to support the Avalanche9000 upgrade, a new chain that has been tested since the end of November. \nAvalanche aims to rebrand from Web3 gaming network\nAvalanche forged its success as one of the leading networks for Web3 and gaming. Avalanche C-Chain was the consumer-oriented L2 network, which carried some of the hottest play-to-earn games. \nC-Chain was also compatible with DeFi, DEX trading, and general Web3 activities. As a result, Avalanche still retains $1.64B in locked liquidity, though still far from the 2021 levels of over $10B. \nOne of the big obstacles to building on Avalanche was the deposit requirement to build a subnet. Subnets were a technology that proved successful for some of the early Avalanche projects. Games or web projects would launch a subnet when their activity overwhelmed the capacity of C-Chain. \nAvalanche now aims to build a practically free layer, similar to SUI or Aptos. Previously, subnet builders had to stake a minimum of 2,000 AVAX. \nInstead of a gaming network, Avalanche9000 will aim to position itself as a tokenization hub, with a focus on Web3 and DeFi. The new L1 will aim to retain some of the successful apps from C-Chain, including DEX and GameFi projects. \nThe funding round arrived just days before the intended launch of Avalanche9000. The chain has already onboarded up to 150K potential users and 40K routers in preparation for its December 16 launch. The chain has already partnered with Uplink, a startup for decentralized connectivity, which will build on the new L1.\nCan AVAX recover to a higher range?\nAVAX was among the most promising L2 tokens, and the project is one of the best-funded in the Web3 space. However, during the bear market, Avalanche C-Chain lagged behind Arbitrum and Optimism. \nAVAX is also carrying a backlog of locked tokens, with only 57% of the supply in circulation. Almost all ecosystem participants and early VC backers will continue to unlock their allocation over the next few years. \nAs a result, AVAX spend years trading under $20. The asset was considered a potential competitor to Solana, though it only expanded above $100 for a brief period. In late 2024, AVAX had another rally to a local high of $55.30. AVAX is close to the top 10 of coins and tokens, gaining additional exposure from its recent market rally. \nAVAX open interest has also recovered above $480M, near the peak of the range for the past three years. The additional exposure from Avalanche9000 and the hype around the main net launch may boost AVAX, as it has shown the ability to outperform. \nAvalanche C-Chain receives $100M of inflows mainly from Ethereum, with around 7% of that bridged amount in stablecoins. Due to its relatively early launch in 2019, Avalanche is also one of the few chains with 1.6B in native Tether (USDT). As a L1 network, Avalanche may offer additional RWA tokenization to some of its partners. \nThe Avalanche Project is actively curated by the Avalanche Foundation. In the past, the Avalanche team has also worked as an incubator for Web3 projects and games. After the launch of the L1 network, Avalanche may retain some of its top projects.\nFrom Zero to Web3 Pro: Your 90-Day Career Launch Plan",
        "summary": "Avalanche (AVAX) has completed a major funding round of $250M in a private sale to transition from a L2 to an independent L1 project. The platform aims to launch Avalanche9000, focusing on becoming a tokenization hub for Web3 and DeFi projects. The funding comes from top VC funds and is the largest capital injection in Avalanche's history, as it prepares for its main net launch. AVAX has shown potential for growth, with a recent rally boosting its open interest and market performance."
    }
]